#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-Lanchonete-G41/tech-challenge-fase-3-iac/runs/run-ccX1Y9pL8MEigprh

Waiting for the plan to start...

Terraform v1.10.2
on linux_amd64
Initializing plugins and modules...
module.db_password_secret.aws_secretsmanager_secret.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr]
data.aws_iam_role.lab_role: Refreshing...
module.lanchonete_http_api.aws_apigatewayv2_api.this: Refreshing state... [id=yvq96tymqj]
module.lanchonete_vpc.aws_vpc.this: Refreshing state... [id=vpc-01ccebb8e1173efa6]
data.aws_iam_role.lab_role: Refresh complete after 0s [id=LabRole]
module.db_password_secret.aws_secretsmanager_secret_version.this: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:721525683170:secret:db-password-wAVJzr|terraform-20241215204947233100000002]
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Refreshing state... [id=$default]
module.lanchonete_db_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-0a18b603050194fdf]
module.lanchonete_eks_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-022c843d74ea0b9d4]
module.lanchonete_eks_private_subnet_a.aws_subnet.this: Refreshing state... [id=subnet-045b7c251df3b06ab]
module.lanchonete_rds_sg.aws_security_group.this: Refreshing state... [id=sg-078fb7125dda17dc5]
module.lanchonete_db_private_subnet_b.aws_subnet.this: Refreshing state... [id=subnet-066ded97972d280f4]
module.lanchonete_eks_cluster.aws_eks_cluster.this: Refreshing state... [id=lanchonete-eks-cluster]
module.lanchonete_rds.aws_db_subnet_group.this: Refreshing state... [id=lanchonete-subnet-group]
module.lanchonete_eks_node_group.aws_eks_node_group.this: Refreshing state... [id=lanchonete-eks-cluster:lanchonete-eks-node-group]
module.lanchonete_rds.aws_db_instance.this: Refreshing state... [id=db-CDPODJYGLX2RS2BVFH3BIF4FPM]
module.lanchonete_http_api.aws_apigatewayv2_stage.this: Drift detected (update)
module.lanchonete_eks_node_group.aws_eks_node_group.this: Drift detected (update)
module.lanchonete_eks_cluster.aws_eks_cluster.this: Drift detected (update)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lanchonete_eks_node_group.aws_eks_node_group.this has changed
  ~ resource "aws_eks_node_group" "this" {
      + arn             = "arn:aws:eks:us-east-1:721525683170:nodegroup/lanchonete-eks-cluster/lanchonete-eks-node-group/9cc9e674-f44c-7000-8828-a4da7c0c8217"
        id              = "lanchonete-eks-cluster:lanchonete-eks-node-group"
      + status          = "CREATE_FAILED"
        tags            = {
            "Provisioner" = "Terraform"
        }
      + version         = "1.31"
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lanchonete_eks_node_group.aws_eks_node_group.this must be replaced
-/+ resource "aws_eks_node_group" "this" {
      ~ ami_type               = "AL2023_x86_64_STANDARD" -> (known after apply)
      ~ arn                    = "arn:aws:eks:us-east-1:721525683170:nodegroup/lanchonete-eks-cluster/lanchonete-eks-node-group/9cc9e674-f44c-7000-8828-a4da7c0c8217" -> (known after apply)
      ~ capacity_type          = "ON_DEMAND" -> (known after apply)
      ~ disk_size              = 20 -> 50
      ~ id                     = "lanchonete-eks-cluster:lanchonete-eks-node-group" -> (known after apply)
      - labels                 = {} -> null
      + node_group_name_prefix = (known after apply)
      ~ release_version        = "1.31.3-20241205" -> (known after apply)
      ~ resources              = [
          - {
              - autoscaling_groups              = [
                  - {
                      - name = "eks-lanchonete-eks-node-group-9cc9e674-f44c-7000-8828-a4da7c0c8217"
                    },
                ]
                # (1 unchanged attribute hidden)
            },
        ] -> (known after apply)
      ~ status                 = "CREATE_FAILED" -> (known after apply)
        tags                   = {
            "Provisioner" = "Terraform"
        }
      ~ version                = "1.31" -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ update_config {
          - max_unavailable_percentage = 0 -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.lanchonete_http_api.aws_apigatewayv2_stage.this will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "this" {
        id                    = "$default"
        name                  = "$default"
        tags                  = {}
        # (10 unchanged attributes hidden)

      ~ default_route_settings {
          ~ throttling_burst_limit   = 20 -> 1000
          ~ throttling_rate_limit    = 100 -> 1000
            # (3 unchanged attributes hidden)
        }
    }

  # module.lanchonete_http_api.aws_apigatewayv2_vpc_link.this will be created
  + resource "aws_apigatewayv2_vpc_link" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "lanchonete-vpc-link"
      + tags_all = (known after apply)
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rafaelvmasc, Action: `pull_request`*